backend/views/layouts/main.php

SELECT * FROM `user` WHERE `id`=2
---
function findModel( $id ) {
	if ( ( $model = User::findOne( $id ) ) !== null ) {