backend/views/site/index.php

SELECT `category`.* FROM `category` LEFT JOIN `page` ON `category`.`page_id` = `page`.`id` ORDER BY `category`.`serial`
---

$this->title = 'Admin RT';

$categories = Category::find()->joinWith( 'page' )->orderBy( 'category.serial ASC' )->all();